<?php

return [
    'management_schema' => [
        'actions' => [
            'label' => 'Εφαρμογή επαλήθευσης',
            'below_content' => 'Χρησιμοποιήστε μια ασφαλή εφαρμογή στο κινητό για να παίρνετε προσωρινό κωδικό σύνδεσης.',
            'messages' => [
                'enabled' => 'Ενεργή',
                'disabled' => 'Ανενεργή',
            ],
        ],
    ],
    'login_form' => [
        'label' => 'Κωδικός από την εφαρμογή επαλήθευσης',
        'code' => [
            'label' => 'Πληκτρολογήστε τον 6ψήφιο κωδικό από την εφαρμογή',
            'validation_attribute' => 'κωδικός',
            'actions' => [
                'use_recovery_code' => ['label' => 'Χρήση κωδικού ανάκτησης'],
            ],
            'messages' => [
                'invalid' => 'Ο κωδικός δεν είναι σωστός.',
            ],
        ],
        'recovery_code' => [
            'label' => 'Ή πληκτρολογήστε έναν κωδικό ανάκτησης',
            'validation_attribute' => 'κωδικός ανάκτησης',
            'messages' => [
                'invalid' => 'Ο κωδικός ανάκτησης δεν είναι σωστός.',
            ],
        ],
    ],
];
